micropython/micropython/ports/espressif/boards/luatos_core_esp32c3/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2019 Scott Shawcroft for Adafruit Industries
//
// SPDX-License-Identifier: MIT

#pragma once

// Board setup

#define MICROPY_HW_BOARD_NAME       "Luatos Core-ESP32C3"
#define MICROPY_HW_MCU_NAME         "ESP32-C3"

// Status LED
#define MICROPY_HW_LED_STATUS (&pin_GPIO12)

#define CIRCUITPY_BOARD_UART        (1)
#define CIRCUITPY_BOARD_UART_PIN    {{.tx = &pin_GPIO21, .rx = &pin_GPIO20}}
